{
    "name": "Maram Farrag",
    "title": "Senior Backend Engineer",
    "about": "I lead the design and implementation of software systems that meet both functional and non-functional requirements. I collaborate with stakeholders, development teams, and other architects to create high-level and detailed designs, covering software components, interfaces, and data models. I also ensure adherence to architectural standards, identify and mitigate technical risks, and communicate project progress and challenges.\n\nWith 7 years of expertise in Node.js and Python, I have a proven track record of delivering end-to-end product development and driving business expansion. At Tactful AI, I successfully led the engineering team that launched the company's first product in the European market, increasing the user base by 35%. I also have experience in developing Customer Support Solutions, including ERP and CMS development and implementing automation. I am proficient in system architecture, microservices, and real-time solutions, using Apache Kafka and Sockets.\n\nI am passionate about continuous learning and innovation, and I actively contribute to open-source projects and communities. I am also a Technical Consultant, providing guidance and support to various engineering functions and operations. My collaborative and results-driven approach enables me to work effectively with diverse teams and stakeholders, fostering cohesion and influencing team members for multiplied results. I am eager to embrace new challenges and contribute to diverse business markets with my skills and experience.",
    "education": {
        "university": "Cairo University",
        "degree": "Bachelor's degree in Computer Science - Software Engineering",
        "year": "2013 - 2017",
        "grade": "3.08 Very Good"
    },
    "experience": [
        {
            "role": "Lead Engineer",
            "company": "Tactful AI",
            "years": "2017 - Present",
            "description": "Led the engineering team to launch the company's first product in the European market, increasing the user base by 35%. Focused on Customer Support Solutions, ERP and CMS development, and implementing automation solutions."
        }
    ],
    "projects": [
        {
            "name": "VR Driving",
            "description": "A project to teach people how to drive using virtual reality and driving simulation to address traffic issues and enhance driving experience. Tools: C#, Unity, Blender, Samsung Gear VR."
        },
        {
            "name": "3M Maps",
            "description": "A social network application enabling users to share locations, rate places, and receive recommendations. Developed web and desktop platforms using Java EE, OpenShift, SQL, and Swing."
        },
        {
            "name": "Artificial Intelligence Applications",
            "description": "Small games console applications using Python."
        },
        {
            "name": "Command Language Interpreter",
            "description": "UNIX-like CLI for executing basic commands. Developed as part of OS course using Java."
        },
        {
            "name": "Compression Algorithms",
            "description": "Implementation of Huffman Coding, Arithmetic Coding, and more as part of Multimedia course using Java."
        },
        {
            "name": "Gifty App",
            "description": "Android mobile app to convert a group of images into a GIF."
        },
        {
            "name": "Meeting Organization Web Application",
            "description": "Web app to find suitable meeting times for participants. Tools: JSP, Servlets, Java EE, AJAX, jQuery, Bootstrap, HTML, CSS, MVC Design Pattern."
        },
        {
            "name": "Movie App (MAL Graduation Project)",
            "description": "Android app displaying movies sorted by rating or popularity, with support for different layouts for mobile and tablets. Integrated IMDB API."
        }
    ],
    "skills": [
        "Java",
        "C++",
        "Python",
        "Node.js",
        "System Architecture",
        "Microservices",
        "Real-Time Solutions (Apache Kafka, Sockets)"
    ]
}
